## Plan Result (883: prod_ai - TerraformPlanApply)




<pre><code>Plan: 14 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.poc_group_sa_blob_contributor
  * module.ai.azurerm_cognitive_account.cognitive_account
  * module.ai.azurerm_machine_learning_compute_instance.compute_instance[0]
  * module.ai.azurerm_private_endpoint.cognitive_private_endpoint
  * module.ai.azurerm_role_assignment.cog_blob_contributor_to_ai_storage_account
  * module.ai.azurerm_role_assignment.cog_blob_contributor_to_file_storage_account[0]
  * module.ai.azurerm_role_assignment.cog_contributor_to_ai_storage_account
  * module.ai.azurerm_role_assignment.cog_contributor_to_file_storage_account[0]
  * module.ai.azurerm_role_assignment.compute_blob_contributor_to_ai_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.compute_blob_contributor_to_file_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.compute_contributor_to_ai_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.compute_contributor_to_file_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.ml_blob_contributor_to_ai_storage_account
  * module.ai.azurerm_role_assignment.ml_blob_contributor_to_file_storage_account[0]
* Update
  * azurerm_key_vault_secret.cognitive_account_primary_access_key
  * azurerm_key_vault_secret.cognitive_account_secondary_access_key
  * module.ai.azurerm_ai_foundry.ai_foundry
  * module.ai.azurerm_storage_account.workspace_storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.cognitive_account_primary_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "cognitive_account_primary_access_key" {
        id                      = "https://dlrm-ingest-ai-kv-prod.vault.azure.net/secrets/cognitive-account-primary-access-key/3416c47da37f490699c5cfa6e612bc92"
        name                    = "cognitive-account-primary-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.cognitive_account_secondary_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "cognitive_account_secondary_access_key" {
        id                      = "https://dlrm-ingest-ai-kv-prod.vault.azure.net/secrets/cognitive-account-secondary-access-key/0df6734f85ee46f8a993377b7818c771"
        name                    = "cognitive-account-secondary-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_role_assignment.poc_group_sa_blob_contributor will be created
  + resource "azurerm_role_assignment" "poc_group_sa_blob_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a0e75592-f51f-46c3-84ef-df609b08eb68"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_ai_foundry.ai_foundry will be updated in-place
  ~ resource "azurerm_ai_foundry" "ai_foundry" {
        id                             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ai-foundry-prod"
        name                           = "dlrm-ingest-ai-foundry-prod"
      ~ tags                           = {
          - "__SYSTEM__AIServices_Enda-m9gxngd8-uksouth"                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/Enda-m9gxngd8-uksouth" -> null
          - "__SYSTEM__AIServices_dlrm-aria-document-migration-res"       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-aria-document-migration-res" -> null
          - "__SYSTEM__AzureOpenAI_Enda-m9gxngd8-uksouth_aoai"            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/Enda-m9gxngd8-uksouth" -> null
          - "__SYSTEM__AzureOpenAI_dlrm-aria-document-migration-res_aoai" = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-aria-document-migration-res" -> null
            "application"                                                 = "dlrm-data-ingest"
            "builtFrom"                                                   = "hmcts/dlrm-data-ingest-infra"
            "businessArea"                                                = "cross-cutting"
            "criticality"                                                 = "High"
            "environment"                                                 = "production"
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_cognitive_account.cognitive_account will be created
  + resource "azurerm_cognitive_account" "cognitive_account" {
      + custom_subdomain_name              = "dlrm-ingest-cognitive-account-prod"
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "FormRecognizer"
      + local_auth_enabled                 = true
      + location                           = "uksouth"
      + name                               = "dlrm-ingest-cognitive-standard-prod"
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = "dlrm-ingest-ai-prod"
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "S0"
      + tags                               = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.ai.azurerm_machine_learning_compute_instance.compute_instance[0] will be created
  + resource "azurerm_machine_learning_compute_instance" "compute_instance" {
      + authorization_type            = "personal"
      + id                            = (known after apply)
      + local_auth_enabled            = true
      + machine_learning_workspace_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-prod"
      + name                          = "dlrm-ingest-ci-prod1"
      + node_public_ip_enabled        = false
      + tags                          = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_machine_size          = "Standard_D2ds_v5"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.ai.azurerm_private_endpoint.cognitive_private_endpoint will be created
  + resource "azurerm_private_endpoint" "cognitive_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-cognitive-account-pe-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-ai-prod"
      + subnet_id                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.cognitiveservices.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "cognitive-account-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "account",
            ]
        }
    }

  # module.ai.azurerm_role_assignment.cog_blob_contributor_to_ai_storage_account will be created
  + resource "azurerm_role_assignment" "cog_blob_contributor_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.cog_blob_contributor_to_file_storage_account[0] will be created
  + resource "azurerm_role_assignment" "cog_blob_contributor_to_file_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.cog_contributor_to_ai_storage_account will be created
  + resource "azurerm_role_assignment" "cog_contributor_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.cog_contributor_to_file_storage_account[0] will be created
  + resource "azurerm_role_assignment" "cog_contributor_to_file_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.compute_blob_contributor_to_ai_storage_account["dlrm-ingest-ci-prod1"] will be created
  + resource "azurerm_role_assignment" "compute_blob_contributor_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.compute_blob_contributor_to_file_storage_account["dlrm-ingest-ci-prod1"] will be created
  + resource "azurerm_role_assignment" "compute_blob_contributor_to_file_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.compute_contributor_to_ai_storage_account["dlrm-ingest-ci-prod1"] will be created
  + resource "azurerm_role_assignment" "compute_contributor_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.compute_contributor_to_file_storage_account["dlrm-ingest-ci-prod1"] will be created
  + resource "azurerm_role_assignment" "compute_contributor_to_file_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.ml_blob_contributor_to_ai_storage_account will be created
  + resource "azurerm_role_assignment" "ml_blob_contributor_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2b7171a-2532-4ecd-9a22-bb5e123b9d43"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.ml_blob_contributor_to_file_storage_account[0] will be created
  + resource "azurerm_role_assignment" "ml_blob_contributor_to_file_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2b7171a-2532-4ecd-9a22-bb5e123b9d43"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_storage_account.workspace_storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "workspace_storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
        name                               = "dlrmingestaisaprod"
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 14 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":100,"Program":"tfcmt","SHA1":"","Target":"883: prod_ai - TerraformPlanApply","Vars":{}} -->